#### taps
##########
tap "oven-sh/bun"

#### brews
##########

# core tools
# core development tools
brew "git"
brew "git-lfs"
brew "git-delta"
brew "stow"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "jq"
brew "fd"
brew "vercel-cli"

# shell
brew "bash"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "neovim"
brew "vim"

# software
brew "fnm"
brew "go"
brew "rust"
brew "pnpm"
brew "uv"
brew "bun"
brew "terraform"
brew "jenv"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"

# helpful utilities
brew "glow"
brew "tldr"
brew "httpie"
brew "mas"
brew "mackup"
brew "duti"
brew "pngpaste"
brew "trash"
brew "watch"
brew "ffmpeg"
brew "libavif"
brew "llvm@19"
brew "pkgconf"
brew "gnupg"
brew "openssh"
brew "rsync"

# cloud and infrastructure
brew "kubectl"
brew "helm"
brew "awscli"

#### casks
##########

# browsers
cask "thebrowsercompany-dia"
cask "google-chrome"

# ide
cask "cursor"
cask "claude-code"
cask "zed"
cask "bruno"
cask "httpie-desktop"
cask "jetbrains-toolbox"
cask "visual-studio-code"

# utilities
cask "ghostty"
cask "1password"
cask "1password-cli"
cask "slack-cli"
cask "raycast"
cask "flycut"
cask "cleanshot"
cask "topnotch"

# apps
cask "affinity"
cask "figma"
cask "slack"
cask "notion"
cask "notion-calendar"

# fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-geist"
cask "font-geist-mono"
cask "font-fontawesome"

# vscode extensions
vscode "isudox.vscode-jetbrains-keybindings"
vscode "yoavbls.pretty-ts-errors"
